Revit 2024 API
ParameterTypeId.FabricationServiceAbbreviation Property
 "Fabrication Service Abbreviation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationServiceAbbreviation { get; }
Visual Basic
Public Shared ReadOnly Property FabricationServiceAbbreviation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationServiceAbbreviation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace